Revit 2027 API
MEPNetworkIterator(Document, MEPAnalyticalSegment) Constructor
 Creates an iterator to visit the connected segments on both sides.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkIterator(
	Document pADoc,
	MEPAnalyticalSegment startSegment
)
Public Sub New (
	pADoc As Document,
	startSegment As MEPAnalyticalSegment
)
public:
MEPNetworkIterator(
	Document^ pADoc,
	MEPAnalyticalSegment^ startSegment
)
new :
        pADoc : Document *
        startSegment : MEPAnalyticalSegment -> MEPNetworkIterator
Parameters
pADoc Document
 The document of the analytical network.
startSegment MEPAnalyticalSegment
 The starting analytical segment.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPNetworkIterator Class
MEPNetworkIterator Overload
Autodesk.Revit.DB.Analysis Namespace